Processing 'bcd.bpf.o'...
PROCESSING /home/ubuntu/bpf-verify/output2/bcd.bpf.o/bpf_prog_bcd, DURATION US: 18, VERDICT: success, VERIFIER LOG:
verification time 18 usec
stack depth 0
processed 2 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

Processing 'clz_tab.bpf.o'...
PROCESSING /home/ubuntu/bpf-verify/output2/clz_tab.bpf.o/bpf_prog_clz_tab, DURATION US: 11, VERDICT: success, VERIFIER LOG:
verification time 11 usec
stack depth 0
processed 2 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

Processing 'cmpdi2.bpf.o'...
PROCESSING /home/ubuntu/bpf-verify/output2/cmpdi2.bpf.o/bpf_prog_cmpdi2, DURATION US: 117, VERDICT: success, VERIFIER LOG:
verification time 117 usec
stack depth 8
processed 37 insns (limit 1000000) max_states_per_insn 0 total_states 3 peak_states 3 mark_read 3

Processing 'muldi3.bpf.o'...
PROCESSING /home/ubuntu/bpf-verify/output2/muldi3.bpf.o/bpf_prog_muldi3, DURATION US: 39, VERDICT: success, VERIFIER LOG:
verification time 39 usec
stack depth 4
processed 13 insns (limit 1000000) max_states_per_insn 0 total_states 1 peak_states 1 mark_read 1

Processing 'ashldi3.bpf.o'...
PROCESSING /home/ubuntu/bpf-verify/output2/ashldi3.bpf.o/bpf_prog_ashldi3, DURATION US: 10, VERDICT: success, VERIFIER LOG:
verification time 10 usec
stack depth 0
processed 2 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0

Processing 'ashrdi3.bpf.o'...

mpih_cmp.bpf.o              bpf_prog_mpih_cmp              success             10            2             0            0
mpih_lshift.bpf.o           bpf_prog_mpih_lshift           success              8            2             0            0
mpih_mul1.bpf.o             bpf_prog_mpih_mul1             success              9            2             0            0
mpih_rshift.bpf.o           bpf_prog_mpih_rshift           success              8            2             0            0
mpih_sub1.bpf.o             bpf_prog_mpih_sub1             success             10            2             0            0
muldi3.bpf.o                bpf_prog_muldi3                success             39           13             1            1
net_dim.bpf.o               bpf_prog_net_dim               success             11            2             0            0
oid_registry.bpf.o          bpf_prog_oid_registry          success             12            2             0            0
packing.bpf.o               bpf_prog_packing               success              9            2             0            0
plist.bpf.o                 bpf_prog_plist                 success             37           10             1            1
rational.bpf.o              bpf_prog_rational              success              9            2             0            0
rational_v2.bpf.o           bpf_prog_rational_v2           success             10            2             0            0
rbtree.bpf.o                bpf_prog_rbtree                success             10            2             0            0
reciprocal_div.bpf.o        bpf_prog_reciprocal_div        success             40           10             1            1
seq_buf.bpf.o               bpf_prog_seq_buf               success             11            2             0            0
siphash.bpf.o               bpf_prog_siphash               success             10            2             0            0
sort.bpf.o                  bpf_prog_sort                  success             10            2             0            0
string.bpf.o                bpf_prog_string                success             11            2             0            0
timerqueue.bpf.o            bpf_prog_timerqueue            success             11            2             0            0
tnum.bpf.o                  bpf_prog_tnum                  success            541          131            12           12
ucmpdi2.bpf.o               bpf_prog_ucmpdi2               success              9            2             0            0
ucs2_string.bpf.o           bpf_prog_ucs2_string           success              9            2             0            0
union_find.bpf.o            bpf_prog_union_find            failure            101           34             2            2
uuid.bpf.o                  bpf_prog_uuid                  success             13            2             0            0
win_minmax.bpf.o            bpf_prog_win_minmax            success              9            2             0            0
xxhash.bpf.o                bpf_prog_xxhash                success             12            2             0            0
zlib_deftree.bpf.o          bpf_prog_zlib_deftree          success             12            2             0            0
zlib_inffast.bpf.o          bpf_prog_zlib_inffast          success             11            2             0            0
zlib_inftrees.bpf.o         bpf_prog_zlib_inftrees         success             10            2             0            0
zstd_decompress.bpf.o       bpf_prog_zstd_decompress       success              9            2             0            0
zstd_entropy_common.bpf.o   bpf_prog_zstd_entropy_common   success             10            2             0            0
zstd_fse_decompress.bpf.o   bpf_prog_zstd_fse_decompress   success              9            2             0            0
zstd_huf_decompress.bpf.o   bpf_prog_zstd_huf_decompress   success              9            2             0            0
--------------------------  -----------------------------  -------  -------------  -----------  ------------  -----------
Done. Processed 87 files, 9 programs. Skipped 87 files, 0 programs.

STDERR:
libbpf: failed to find BTF for extern '__bitmap_weight' [60] section: -2
Failed to open '/home/ubuntu/bpf-verify/output2/find_bit.bpf.o': -2
libbpf: elf: skipping relo section(8) .rel.rodata for section(7) .rodata
libbpf: failed to find BTF for extern 'mem_dump_obj' [23] section: -2
Failed to open '/home/ubuntu/bpf-verify/output2/list_debug.bpf.o': -2
libbpf: sec '.exit.text': program 'exit_fsm' is static and not supported
Failed to open '/home/ubuntu/bpf-verify/output2/ts_fsm.bpf.o': -95
libbpf: sec '.exit.text': program 'exit_kmp' is static and not supported
Failed to open '/home/ubuntu/bpf-verify/output2/ts_kmp.bpf.o': -95
libbpf: failed to find BTF for extern 'strnlen' [30] section: -2
Failed to open '/home/ubuntu/bpf-verify/output2/net_utils.bpf.o': -2
libbpf: elf: skipping unrecognized data section(4) .initcall4.init
libbpf: elf: skipping relo section(5) .rel.initcall4.init for section(4) .initcall4.init
libbpf: sec '.init.text': program 'aes_mod_init' is static and not supported
Failed to open '/home/ubuntu/bpf-verify/output2/lib_aes.bpf.o': -95
libbpf: failed to find BTF for extern '__bpf_sha256_transform' [106] section: -2
Failed to open '/home/ubuntu/bpf-verify/output2/lib_sha256.bpf.o': -2
libbpf: failed to find BTF for extern 'chacha_block_generic' [28] section: -2
Failed to open '/home/ubuntu/bpf-verify/output2/lib_chacha.bpf.o': -2
libbpf: failed to find BTF for extern 'memcpy' [47] section: -2
Failed to open '/home/ubuntu/bpf-verify/output2/zlib_inflate.bpf.o': -2
libbpf: elf: skipping relo section(10) .rel.data for section(9) .data
libbpf: BTF loading error: -22
libbpf: -- BEGIN BTF LOAD LOG ---
magic: 0xeb9f
version: 1
flags: 0x0
hdr_len: 24
type_off: 0
type_len: 3176
str_off: 3176
str_len: 13225
btf_total_size: 16425
[1] PTR (anon) type_id=3
[2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=1
[4] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] PTR (anon) type_id=6
[6] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=4
[7] PTR (anon) type_id=8
[8] TYPEDEF __u32 type_id=9
[9] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
[10] PTR (anon) type_id=11
[11] TYPEDEF __u64 type_id=12
[12] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[13] STRUCT (anon) size=32 vlen=4
	type type_id=1 bits_offset=0
	max_entries type_id=5 bits_offset=64
	key type_id=7 bits_offset=128
	value type_id=10 bits_offset=192
[14] VAR input_map type_id=13 linkage=1
[15] PTR (anon) type_id=16
[16] TYPEDEF deflate_state type_id=17
[17] STRUCT deflate_state size=5928 vlen=58
	strm type_id=18 bits_offset=0
	status type_id=2 bits_offset=64
	pending_buf type_id=21 bits_offset=128
	pending_buf_size type_id=24 bits_offset=192
	pending_out type_id=21 bits_offset=256
	pending type_id=2 bits_offset=320
	noheader type_id=2 bits_offset=352
	data_type type_id=22 bits_offset=384
	method type_id=22 bits_offset=392
	last_flush type_id=2 bits_offset=416
	w_size type_id=26 bits_offset=448
	w_bits type_id=26 bits_offset=480
	w_mask type_id=26 bits_offset=512
	window type_id=21 bits_offset=576
	window_size type_id=24 bits_offset=640
	prev type_id=27 bits_offset=704
	head type_id=27 bits_offset=768
	ins_h type_id=26 bits_offset=832
	hash_size type_id=26 bits_offset=864
	hash_bits type_id=26 bits_offset=896
	hash_mask type_id=26 bits_offset=928
	hash_shift type_id=26 bits_offset=960
	block_start type_id=31 bits_offset=1024
	match_length type_id=26 bits_offset=1088
	prev_match type_id=32 bits_offset=1120
	match_available type_id=2 bits_offset=1152
	strstart type_id=26 bits_offset=1184
	match_start type_id=26 bits_offset=1216
	lookahead type_id=26 bits_offset=1248
	prev_length type_id=26 bits_offset=1280
	max_chain_length type_id=26 bits_offset=1312
	max_lazy_match type_id=26 bits_offset=1344
	level type_id=2 bits_offset=1376
	strategy type_id=2 bits_offset=1408
	good_match type_id=26 bits_offset=1440
	nice_match type_id=2 bits_offset=1472
	dyn_ltree type_id=36 bits_offset=1504
	dyn_dtree type_id=37 bits_offset=19840
	bl_tree type_id=38 bits_offset=21792
	l_desc type_id=39 bits_offset=23040
	d_desc type_id=39 bits_offset=23232
	bl_desc type_id=39 bits_offset=23424
	bl_count type_id=44 bits_offset=23616
	heap type_id=45 bits_offset=23872
	heap_len type_id=2 bits_offset=42208
	heap_max type_id=2 bits_offset=42240
	depth type_id=47 bits_offset=42272
	l_buf type_id=48 bits_offset=46912
	lit_bufsize type_id=26 bits_offset=46976
	last_lit type_id=26 bits_offset=47008
	d_buf type_id=49 bits_offset=47040
	opt_len type_id=24 bits_offset=47104
	static_len type_id=24 bits_offset=47168
	compressed_len type_id=24 bits_offset=47232
	matches type_id=26 bits_offset=47296
	last_eob_len type_id=2 bits_offset=47328
	bi_buf type_id=29 bits_offset=47360
	bi_valid type_id=2 bits_offset=47392
[18] TYPEDEF z_streamp type_id=19
[19] PTR (anon) type_id=20
[20] TYPEDEF z_stream type_id=123
[21] PTR (anon) type_id=22
[22] TYPEDEF Byte type_id=23
[23] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
[24] TYPEDEF ulg type_id=25
[25] INT unsigned long size=8 bits_offset=0 nr_bits=64 encoding=(none)
[26] TYPEDEF uInt type_id=9
[27] PTR (anon) type_id=28
[28] TYPEDEF Pos type_id=29
[29] TYPEDEF ush type_id=30
[30] INT unsigned short size=2 bits_offset=0 nr_bits=16 encoding=(none)
[31] INT long size=8 bits_offset=0 nr_bits=64 encoding=SIGNED
[32] TYPEDEF IPos type_id=9
[33] STRUCT ct_data_s size=4 vlen=2
	fc type_id=34 bits_offset=0
	dl type_id=35 bits_offset=16
[34] UNION (anon) size=2 vlen=2
	freq type_id=29 bits_offset=0
	code type_id=29 bits_offset=0
[35] UNION (anon) size=2 vlen=2
	dad type_id=29 bits_offset=0
	len type_id=29 bits_offset=0
[36] ARRAY (anon) type_id=33 index_type_id=4 nr_elems=573
[37] ARRAY (anon) type_id=33 index_type_id=4 nr_elems=61
[38] ARRAY (anon) type_id=33 index_type_id=4 nr_elems=39
[39] STRUCT tree_desc_s size=24 vlen=3
	dyn_tree type_id=40 bits_offset=0
	max_code type_id=2 bits_offset=64
	stat_desc type_id=42 bits_offset=128
[40] PTR (anon) type_id=41
[41] TYPEDEF ct_data type_id=33
[42] PTR (anon) type_id=43
[43] TYPEDEF static_tree_desc type_id=106
[44] ARRAY (anon) type_id=29 index_type_id=4 nr_elems=16
[45] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=573
[46] TYPEDEF uch type_id=23
[47] ARRAY (anon) type_id=46 index_type_id=4 nr_elems=573
[48] PTR (anon) type_id=46
[49] PTR (anon) type_id=29
[50] FUNC_PROTO (anon) return=0 args=(15 s)
[51] FUNC zlib_tr_init type_id=50
[52] FUNC_PROTO (anon) return=0 args=(15 s)
[53] FUNC init_block type_id=52
[54] PTR (anon) type_id=55
[55] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[56] FUNC_PROTO (anon) return=0 args=(15 s, 54 buf, 24 stored_len, 2 eof)
[57] FUNC zlib_tr_stored_block type_id=56
[58] FUNC_PROTO (anon) return=0 args=(15 s)
[59] FUNC zlib_tr_stored_type_only type_id=58
[60] FUNC_PROTO (anon) return=0 args=(15 s)
[61] FUNC zlib_tr_align type_id=60
[62] FUNC_PROTO (anon) return=24 args=(15 s, 54 buf, 24 stored_len, 2 eof)
[63] FUNC zlib_tr_flush_block type_id=62
[64] PTR (anon) type_id=65
[65] TYPEDEF tree_desc type_id=39
[66] FUNC_PROTO (anon) return=0 args=(15 s, 64 desc)
[67] FUNC build_tree type_id=66
[68] FUNC_PROTO (anon) return=0 args=(15 s, 40 ltree, 40 dtree)
[69] FUNC compress_block type_id=68
[70] FUNC_PROTO (anon) return=2 args=(15 s, 9 dist, 9 lc)
[71] FUNC zlib_tr_tally type_id=70
[72] PTR (anon) type_id=0
[73] FUNC_PROTO (anon) return=2 args=(72 ctx)
[74] FUNC bpf_prog_zlib_deftree type_id=73
[75] FUNC_PROTO (anon) return=0 args=(15 s, 40 tree, 2 k)
[76] FUNC pqdownheap type_id=75
[77] FUNC_PROTO (anon) return=0 args=(40 tree, 2 max_code, 49 bl_count)
[78] FUNC gen_codes type_id=77
[79] FUNC_PROTO (anon) return=0 args=(15 s, 40 tree, 2 max_code)
[80] FUNC send_tree type_id=79
[81] CONST (anon) type_id=82
[82] TYPEDEF u8 type_id=83
[83] TYPEDEF __u8 type_id=23
[84] ARRAY (anon) type_id=81 index_type_id=4 nr_elems=256
[85] VAR byte_rev_table type_id=84 linkage=1
[86] ARRAY (anon) type_id=41 index_type_id=4 nr_elems=288
[87] VAR static_ltree type_id=86 linkage=0
[88] ARRAY (anon) type_id=41 index_type_id=4 nr_elems=30
[89] VAR static_dtree type_id=88 linkage=0
[90] ARRAY (anon) type_id=46 index_type_id=4 nr_elems=256
[91] VAR length_code type_id=90 linkage=0
[92] ARRAY (anon) type_id=46 index_type_id=4 nr_elems=512
[93] VAR dist_code type_id=92 linkage=0
[94] CONST (anon) type_id=2
[95] ARRAY (anon) type_id=94 index_type_id=4 nr_elems=30
[96] VAR extra_dbits type_id=95 linkage=0
[97] ARRAY (anon) type_id=55 index_type_id=4 nr_elems=4
[98] VAR _license type_id=97 linkage=1
[99] VAR tr_static_init.static_init_done type_id=2 linkage=0
[100] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=29
[101] VAR base_length type_id=100 linkage=0
[102] ARRAY (anon) type_id=94 index_type_id=4 nr_elems=29
[103] VAR extra_lbits type_id=102 linkage=0
[104] ARRAY (anon) type_id=2 index_type_id=4 nr_elems=30
[105] VAR base_dist type_id=104 linkage=0
[106] STRUCT static_tree_desc_s size=32 vlen=5
	static_tree type_id=107 bits_offset=0
	extra_bits type_id=109 bits_offset=64
	extra_base type_id=2 bits_offset=128
	elems type_id=2 bits_offset=160
	max_length type_id=2 bits_offset=192
[107] PTR (anon) type_id=108
[108] CONST (anon) type_id=41
[109] PTR (anon) type_id=94
[110] VAR static_l_desc type_id=43 linkage=0
[111] VAR static_d_desc type_id=43 linkage=0
[112] ARRAY (anon) type_id=94 index_type_id=4 nr_elems=19
[113] VAR extra_blbits type_id=112 linkage=0
[114] VAR static_bl_desc type_id=43 linkage=0
[115] CONST (anon) type_id=46
[116] ARRAY (anon) type_id=115 index_type_id=4 nr_elems=19
[117] VAR bl_order type_id=116 linkage=0
[118] DATASEC .bss size=2280 vlen=7
	 type_id=87 offset=0 size=1152
	 type_id=89 offset=1152 size=120
	 type_id=91 offset=1272 size=256
	 type_id=93 offset=1528 size=512
	 type_id=99 offset=2040 size=1
	 type_id=101 offset=2044 size=116
	 type_id=105 offset=2160 size=120
[119] DATASEC .data size=96 vlen=3
	 type_id=110 offset=0 size=32
	 type_id=111 offset=32 size=32
	 type_id=114 offset=64 size=32
[120] DATASEC .maps size=32 vlen=1
	 type_id=14 offset=0 size=32
[121] DATASEC .rodata size=587 vlen=5
	 type_id=85 offset=0 size=256
	 type_id=96 offset=256 size=120
	 type_id=103 offset=376 size=116
	 type_id=113 offset=492 size=76
	 type_id=117 offset=568 size=19
[122] DATASEC license size=4 vlen=1
	 type_id=98 offset=0 size=4
[123] FWD z_stream_s struct
[118] DATASEC .bss size=2280 vlen=7
	 type_id=99 offset=2040 size=1 Invalid size

-- END BTF LOAD LOG --
libbpf: Error loading .BTF into kernel: -22. BTF is optional, ignoring.
libbpf: prog 'bpf_prog_base64': BPF program load failed: Permission denied
libbpf: prog 'bpf_prog_base64': failed to load: -13
libbpf: failed to load object '/home/ubuntu/bpf-verify/output2/base64.bpf.o'
libbpf: prog 'bpf_prog_union_find': BPF program load failed: Invalid argument
libbpf: prog 'bpf_prog_union_find': failed to load: -22
libbpf: failed to load object '/home/ubuntu/bpf-verify/output2/union_find.bpf.o'
libbpf: elf: skipping relo section(8) .rel.rodata for section(7) .rodata
libbpf: prog 'bpf_prog_min_heap': BPF program load failed: Invalid argument
libbpf: prog 'bpf_prog_min_heap': failed to load: -22
libbpf: failed to load object '/home/ubuntu/bpf-verify/output2/min_heap.bpf.o'
libbpf: elf: skipping relo section(6) .rel.rodata for section(5) .rodata
